app/Models/BooksModel.php

    public function getBooks($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
---
SELECT *
FROM `books`